[{"id": "12hlp2n", "title": "YouTube Premium gets iOS SharePlay support, 1080p enhanced bitrate, and more - Tip3X", "flair": "Discussion", "subreddit": "r/apple", "created_utc": 1681139525.0, "upvote": 1308, "score": 1308, "upvote_ratio": 0.96, "self_text": "", "self_url": "https://www.tip3x.com/2023/04/10/youtube-premium-gets-ios-shareplay-support-1080p-enhanced-bitrate-and-more/", "permalink": "/r/apple/comments/12hlp2n/youtube_premium_gets_ios_shareplay_support_1080p/", "shortlink": "https://redd.it/12hlp2n", "author": "t2_vipbw8ad", "comment_count": 298, "comments": [{"comment_author": "t2_mutafn2g", "body": "So this is a common bug? Unbelivable. For 30-45 days, app has been crashing. Never had this before. YT music also rather buggy too. Google Home, ironically has gotten worse in the years. Hate complaining, hope they fix it.", "created_utc": 1681146973.0, "edited": false, "id": "jfpvye3", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hlp2n/youtube_premium_gets_ios_shareplay_support_1080p/jfpvye3/", "score": 3, "ups": 3}, {"comment_author": "t2_1qdj", "body": "Yes! Happens with iOS/iPadOS YouTube app on almost any airplay (video) device. I tried it on a Mac and Apple TV. \n\nIt’s not common based on Twitter and reddit search but it’s there. And it’s annoying.\n\nFor me it started mid March. On multiple accounts.", "created_utc": 1681145819.0, "edited": false, "id": "jfpsyza", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hlp2n/youtube_premium_gets_ios_shareplay_support_1080p/jfpsyza/", "score": 3, "ups": 3}, {"comment_author": "t2_1qdj", "body": "It’s not a common problem.", "created_utc": 1681154360.0, "edited": false, "id": "jfqewct", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hlp2n/youtube_premium_gets_ios_shareplay_support_1080p/jfqewct/", "score": 0, "ups": 0}, {"comment_author": "t2_4fyipj0", "body": "Stock player looks horrible but AVplayer is fine. Is there a way to login to an indidious account or do I have to manually subscribe to people", "created_utc": 1681149975.0, "edited": false, "id": "jfq3ris", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hlp2n/youtube_premium_gets_ios_shareplay_support_1080p/jfq3ris/", "score": 3, "ups": 3}]}, {"id": "12hdva3", "title": "Apple meets with retail workers countrywide to \"address unionization risks.\"", "flair": null, "subreddit": "r/apple", "created_utc": 1681120693.0, "upvote": 1970, "score": 1970, "upvote_ratio": 0.93, "self_text": "", "self_url": "https://www.stromecptol.com/apple-meets-with-retail-workers-countrywide-to-address-unionization-risks/", "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/", "shortlink": "https://redd.it/12hdva3", "author": "t2_uec23tcq", "comment_count": 425, "comments": [{"comment_author": "t2_d9nloudx", "body": "Most tech companies already have equity (e.g., RSUs, ESPP, sometimes options) as part of their compensation packages.\n\nIt's at best no better than and at worst inferior to equivalent amount in cash in hand, because if your TC was all in salary, you can always buy your own shares. Often when RSUs vest, you would sell, depending on how you answer this question: \"If I gave you an equivalent amount of cash in hand right now, would you immediately spend it all to buy stock in your company?\"\n\nCompanies set part of compensation in equity because it incentivizes employees to stick with the company and makes it in their interest to see the company do well, but cash is more flexible and powerful.", "created_utc": 1681143802.0, "edited": 1681158576.0, "id": "jfpntzd", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/jfpntzd/", "score": 1, "ups": 1}, {"comment_author": "t2_a7w6t", "body": "Enforcers of the state shouldn’t be entitled to union protections. Simple as. Now stop acting like you actually care about the common man.", "created_utc": 1681135249.0, "edited": false, "id": "jfp33hz", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/jfp33hz/", "score": 7, "ups": 7}, {"comment_author": "t2_4r6tasm2", "body": "I had great benefits and stock options when I worked there. Starting pay was easily $5 more than other retail jobs and this was a decade ago. I know Genius Bar technicians start at $30 these days… which is super difficult to get into. But regular retail makes good money. That is NOT to say I’m anti-union at all. I really think they should unionize and have since before they fired me. I just think it’s inaccurate to portray them as underpaying their retail employees and doesn’t help the unionization argument to present false information.", "created_utc": 1681152489.0, "edited": false, "id": "jfqa6pn", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/jfqa6pn/", "score": 6, "ups": 6}, {"comment_author": "t2_m52hq", "body": "Compared to other tech CEOs Tim Apple is a lot more level headed. But that doesn't mean there isn't a hell of a lot of room for improvement. Even if he personally doesn't aim for infinite growth (doubt), his board of directors do. The stock must go up at all costs.", "created_utc": 1681156804.0, "edited": false, "id": "jfql2pl", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/jfql2pl/", "score": 1, "ups": 1}, {"comment_author": "t2_nt9ey", "body": "The most common problem I’ve found with unions nowadays is that they protect the worst employees, so it can be pretty demoralizing when one of your coworkers, who doesn’t work nearly as hard as you do, is getting the same compensation. If a company can’t fire underperforming workers, that’s a major problem for everyone.", "created_utc": 1681156880.0, "edited": false, "id": "jfql9qe", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/jfql9qe/", "score": 2, "ups": 2}, {"comment_author": "t2_xhvlj", "body": "ESPP isn’t that great. You’re using your own money. And it’s capped to a percentage of salary. So a retail worker making $50k is allowed the privilege of buying $5,880 of stock for $5,000 (10% of salary at a 15% discount). In this example, the benefit is only worth $880. \n\nMeanwhile corporate employees are provided with $100k+ of RSUs annually. And the same math for a corporate employee with a $200k salary means they can buy $23.5k of stock for $20k.", "created_utc": 1681170914.0, "edited": false, "id": "jfrie32", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/jfrie32/", "score": 0, "ups": 0}, {"comment_author": "t2_6gc86vq", "body": "Apple’s cash stash doesn’t care one iota what their stock is worth. And vice versa: the stocks value takes into account the cash stash.", "created_utc": 1681149388.0, "edited": false, "id": "jfq28q9", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/jfq28q9/", "score": 1, "ups": 1}, {"comment_author": "t2_3ungyceug", "body": "it is of course a matter of opinion whether it is 'that great'\n\nbut IMO it is one of the best benefits on offer, especially if you consider what Apple is allowed to offer by law (and they offer the max allowable)\n\nyour calculation is for a mediocre purchasing period. you are offered a 15% discount on the lower of two prices, the price at the beginning *and* the price at the end of the offer period. so yes, there's a chance for 'just' a 15% discount, but on the other hand you may be able to buy the stock at a *much steeper* discount, if you're just trying to cash in for short term gains\n\nand AAPL is historically an insanely great buy short or long\n\nI think anyone who doesn't see the potential for upside here is frankly financially shortsighted and doesn't know how easy it is to leverage only a few free percentage points into an enormous addition to personal net worth", "created_utc": 1681172000.0, "edited": false, "id": "jfrktpe", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/jfrktpe/", "score": 7, "ups": 7}, {"comment_author": "t2_xhvlj", "body": "Well, it's certainly less great than just *giving the workers stock for free*. Retail employees already don't make very much money. So it's not that great if someone is in the position between having enough money for rent versus using their own money to purchase their employer's stock. As I mentioned, it's a much better deal for corporate employees who have a higher salaries. \n\n> your calculation is for a mediocre purchasing period. you are offered a 15% discount on the lower of two prices, the price at the beginning and the price at the end of the offer period. so yes, there's a chance for 'just' a 15% discount, but on the other hand you may be able to buy the stock at a much steeper discount\n\nYou're right, I didn't consider taxes. But in absolute terms, I don't think it ends up being a meaningful amount on a retail worker's salary. We're only talking about $4k-$7k of stock per year. In the best case scenario, you get maybe an extra $2k compared to buying the stock at retail and paying taxes on the gains? In that case, the benefit is worth $200/month. \n\nI still don't think it's that great of a program for retail employees compared to paying them higher salaries and providing more RSUs.", "created_utc": 1681174769.0, "edited": false, "id": "jfrr2xp", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/jfrr2xp/", "score": 0, "ups": 0}, {"comment_author": "t2_3wjlr4l6", "body": "So striking is obviously the most severe action that is still societally acceptable (I don’t want violence if at all avoidable) but in the United States at least, there’s active attempts to make striking more burdensome on the workers, for example making workers liable for “lost revenue” due to the strike (i.e., negating the whole point of the strike).\n\nThis is in addition to the general weakening of worker protections and labor laws, as well as removing the teeth of the NLRB, the body responsible for oversight and worker complaints re: unionizing and union contracts (I’m super generalizing here).\n\nSo the US is getting to that point of “making violent revolution inevitable”.\n\nIn the EU, your workers’ rights culture is much stronger. Strikes are more common, and they generally work.\n\nThe US doesn’t have that same culture, and collective action in this country is extremely difficult due to laws, brainwashing, and corporate media controlling the message. Meaning that window in which striking is effective and possible is continually shrinking, to the point where we go from A to B to D (because C just doesn’t matter anymore).", "created_utc": 1681151292.0, "edited": false, "id": "jfq756l", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/jfq756l/", "score": 7, "ups": 7}, {"comment_author": "t2_3ungyceug", "body": ">Well, it's certainly less great than just giving the workers stock for free.\n\nliterally nobody gets anything 'for free.' this is all pay, compensation for services rendered. If your standard is that retail employees should just get paid like SWEs I don't know what to tell you. It's still a very good deal; instead of saving 10% of your income, you buy very high performing stock with it at a discount.\n\n>You're right, I didn't consider taxes.\n\n…and you still didn't consider the price of the stock. there's been at least one purchasing period where the price at grant was >50% higher than the purchase price, which is lowered by 15% before purchase.\n\nif your position is 'that's only a few thousand dollars gain,' I mean… 'a few thousand dollars' is a very significant portion of the salaries of people who have a middling income like retail workers, and contributes mightily to their current security and futures", "created_utc": 1681181402.0, "edited": false, "id": "jfs5fnj", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/jfs5fnj/", "score": 1, "ups": 1}, {"comment_author": "t2_cijwlevu", "body": "https://jobs.apple.com/en-us/details/114438158/us-specialist-full-time-part-time-and-part-time-temporary?team=APPST\n\n>Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. \n\nSounds like retail employees are shareholders?", "created_utc": 1681135918.0, "edited": false, "id": "jfp4m3e", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/jfp4m3e/", "score": 2, "ups": 2}, {"comment_author": "t2_xhvlj", "body": "Look, I'm not saying that retail employees should be compensated the same as SWEs. I’m saying that: \n\n1) Retail employees are under-compensated\n\n2) The company can obviously afford to compensate them more\n\n3) ESPP has limited benefit to retail employees vs higher paid corporate employees, and that the benefit is less than RSUs or just a higher salary \n\n>…and you still didn't consider the price of the stock. there's been at least one purchasing period where the price at grant was >50% higher than the purchase price, which is lowered by 15% before purchase.\n\nI'm comparing the value of ESPP against buying the stock, at retail, at the same time as the opening of the ESPP period. Please explain if I am missing something and there is something fundamentally different about buying stock now but at its lower price from 6 months ago versus simply having purchased it at the lower price six months ago. \n\nMath on an employee making $50k/yr: It is ESPP grant day, and AAPL has gone from $100 to $150. The employee has contributed 10%, or $2500. They receive 29 shares of AAPL ($2500/($100 * .85)) which is now worth (29 * $150 = $4350. \n\nWhen the employee sells, they profit $4350 - $2500 = $1850\n\nAnother person has simply purchased $2500 of AAPL at $100. They have 25 shares. The shares are now worth $3750. If they sell, they profit ($3750 - $2500) - 22% taxes = $975. So the Apple employee is ahead by **$875**. \n\nNext half, AAPL goes up another 50%, to $225. The employee has 19 shares (purchased at $150 - 15%) worth $4275. Net: $4275-$2850=$1,425.\nThe other person’s shares (16 shares at $150) are now worth $3600. They get $3600 - $2400 - 22% tax = $936. The employee is ahead by **$489.**\n\nOver one year, the employee making $50k is up $875 + $489 = $1364 compared to someone who bought stock at the same time. This is even less than I guessed!\n\n>if your position is 'that's only a few thousand dollars gain,' I mean… 'a few thousand dollars' is a very significant portion of the salaries of people who have a middling income like retail workers, and contributes mightily to their current security and futures\n\nI'm saying they should get MORE money. I don’t really know what you’re trying to argue here. I can't have a discussion with you in good faith if you think that a ~$1500/yr benefit helps anyone very much. \n\nHere is what I am saying: \n\n- Higher salaries: Yes. (This would also increase the value of ESPP). \n\n- RSUs for retail employees: Yes. \n\n- ESPP as a benefit which is worth maybe a few hundred to a few thousand per year (compared to buying just buying stock at retail)? Sure, that's nice, but as I've said, it's not that great.", "created_utc": 1681184888.0, "edited": false, "id": "jfsc2c2", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/jfsc2c2/", "score": 1, "ups": 1}, {"comment_author": "t2_a7w6t", "body": "About half the benefits you listed are only slightly discounted or are reimbursements and not “free” at all. Apples profitability suggests they should be taking greater care to ensure their employees needs are being met. Healthcare would be the big, glaring omission from your initial list. A 401k match is only useful if the employee has a 401k. Stock discount works out to about 10% or sales tax in most places. 🥱 \n\nHonestly the boot licking is fascinating to witness. You’re so thoroughly indoctrinated by the capitalist condition that you’re actually just grateful for a company to be taking advantage of your labor. Which brings me back to: bless your heart.", "created_utc": 1681140406.0, "edited": false, "id": "jfpfc8l", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/jfpfc8l/", "score": 9, "ups": 9}, {"comment_author": "t2_57ft0", "body": "Negotiation is a common occurrence when parties have differing but overlapping priorities and beliefs. This is what unions do all over the world, and in basically every other country it not only works but is widely accepted.\n\nIf the company feels threatened by collective bargaining, that's only an indication that their negotiating position is overplayed and reliant upon a lopsided power dynamic whereby they could exploit individual employees.\n\nEmployees seeking to form a union is usually the result of the company abusing its power in the first place.", "created_utc": 1681155180.0, "edited": false, "id": "jfqgye8", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/jfqgye8/", "score": 3, "ups": 3}, {"comment_author": "t2_a7w6t", "body": "[yes, let’s stick to verifiable facts.](https://www.epi.org/blog/apple-store-employees-wages/) like the fact that Apple pays just above poverty level wages to MOST of its employees. \n\nJust because Apple offers stock to hourlies doesn’t mean they’re taking advantage of it, so your insinuation that they are is tenuous at best. That’s why you’re trying so hard to discredit my assertions. You can’t prove your point. But I can prove mine.", "created_utc": 1681138526.0, "edited": false, "id": "jfparjk", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hdva3/apple_meets_with_retail_workers_countrywide_to/jfparjk/", "score": 5, "ups": 5}]}, {"id": "12hrjkb", "title": "Production on 15-Inch MacBook Air Components Underway, WWDC Launch Looking Likely", "flair": "Rumor", "subreddit": "r/apple", "created_utc": 1681151513.0, "upvote": 208, "score": 208, "upvote_ratio": 0.95, "self_text": "", "self_url": "https://www.macrumors.com/2023/04/10/15-inch-macbook-air-component-production/", "permalink": "/r/apple/comments/12hrjkb/production_on_15inch_macbook_air_components/", "shortlink": "https://redd.it/12hrjkb", "author": "t2_592euj7", "comment_count": 60, "comments": [{"comment_author": "t2_znnxp", "body": "Well aren’t the chips normally more like 1 Gb (not GB) and so you can just them together until you get to 12 GB? I know it’s not super common though. Apple offers 24 GB so that’s either using 2 12 or 3 8s. They could also then use 3 4s and that would get to 12 right?", "created_utc": 1681171075.0, "edited": false, "id": "jfriqzg", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hrjkb/production_on_15inch_macbook_air_components/jfriqzg/", "score": 2, "ups": 2}]}, {"id": "12hejo0", "title": "Apple takes the biggest hit with global shipments of personal computers (PCs) fell by 29 per cent", "flair": "Mac", "subreddit": "r/apple", "created_utc": 1681122526.0, "upvote": 568, "score": 568, "upvote_ratio": 0.92, "self_text": "", "self_url": "https://www.channelnewsasia.com/business/global-pc-shipments-slide-q1-apple-takes-biggest-hit-idc-3407746", "permalink": "/r/apple/comments/12hejo0/apple_takes_the_biggest_hit_with_global_shipments/", "shortlink": "https://redd.it/12hejo0", "author": "t2_dyc5p", "comment_count": 221, "comments": [{"comment_author": "t2_fqxf9", "body": "I will wait to hear from Apple about their decline in sales. I never put too much stock in any of these reports. They are often wrong especially when it comes to Apple.", "created_utc": 1681140442.0, "edited": false, "id": "jfpffgq", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12hejo0/apple_takes_the_biggest_hit_with_global_shipments/jfpffgq/", "score": 0, "ups": 0}, {"comment_author": "t2_ujys53as", "body": "...like Stage Manager only working on the newest iPads because apparently window managers require only the newest chip. How Windows, Android, Linux have window managers running without the M1 chip is just a mystery to the tech world. Hey common [it's not like someone found a work around to enable Stage Manager on the old iPads](https://old.reddit.com/r/jailbreak/comments/10scdy5/question_tweak_for_palera1n_16x_enable_stage/) and Apple is just forcing sales right?\n\nPerhaps stop buying into the propaganda?", "created_utc": 1681143004.0, "edited": false, "id": "jfplug4", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hejo0/apple_takes_the_biggest_hit_with_global_shipments/jfplug4/", "score": 18, "ups": 18}, {"comment_author": "t2_fqzk9", "body": ">Why are you mocking me\n\n>3d modelling is still niche compared to other types of work\n\nThat was my only point. Yes, what you are doing requires a lot of computing power, but it is relatively niche, like my joking examples.\n\nGaming is the most common example of a common computational power hungry application, but a Mac usually isn't the platform of choice for that anyway. \n\nMy wild-ass-guess is that 90% of us out here are plugging away Internet browsing, email, maybe word processing and spreadsheets,  maybe some occasional light video editing or social media video producing, watching streaming content, and a hodgepodge of activities. Most of us feel our computers getting slower just because everything is turning into bloatware rather than doing activities that take hours (or even minutes) to process on a Mac.", "created_utc": 1681167390.0, "edited": false, "id": "jfragcv", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12hejo0/apple_takes_the_biggest_hit_with_global_shipments/jfragcv/", "score": 1, "ups": 1}]}, {"id": "12htk0u", "title": "Apple’s 40% Plunge in PC Shipments Is Steepest Among Major Computer Makers", "flair": "Mac", "subreddit": "r/apple", "created_utc": 1681155481.0, "upvote": 21, "score": 21, "upvote_ratio": 0.66, "self_text": "", "self_url": "https://bloomberg.omni.se/apple-s-40-plunge-in-pc-shipments-is-steepest-among-major-computer-makers/a/EQmvQA", "permalink": "/r/apple/comments/12htk0u/apples_40_plunge_in_pc_shipments_is_steepest/", "shortlink": "https://redd.it/12htk0u", "author": "t2_3b78y5", "comment_count": 18, "comments": [{"comment_author": "t2_prmboenp", "body": "Were any material percentage of Mac sales ever based on folks \"upgrading\" from a year-old Mac? There is no company I know that gives its employees new Macs with every yearly release. And I know no one who buys a Mac for their personal use yearly (and hanging onto a Mac for more than five years for personal use seems plenty common). I'm sure there are some, but is this 2% of Mac yearly sales? Is it 10% of Mac yearly sales?\n\nI suspect we are just seeing fallout from macro economic activity, including the mass layoffs that we've seen in Tech Industry over the last six months. First, if you aren't hiring, you aren't buying new equipment. Second, if there is a budget cut in a department, then stretching upgrades another year is an easy step. Third, if you've laid off a bunch of people you can repurpose their equipment, maybe handing up some of the new stuff to the employees you keep.", "created_utc": 1681159636.0, "edited": false, "id": "jfqs747", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12htk0u/apples_40_plunge_in_pc_shipments_is_steepest/jfqs747/", "score": 10, "ups": 10}]}, {"id": "12he7nb", "title": "Hands-On With Tesla's $300 AirPower-Like Wireless Charger", "flair": "Discussion", "subreddit": "r/apple", "created_utc": 1681121626.0, "upvote": 85, "score": 85, "upvote_ratio": 0.73, "self_text": "", "self_url": "https://www.macrumors.com/2023/04/07/tesla-charger-hands-on/", "permalink": "/r/apple/comments/12he7nb/handson_with_teslas_300_airpowerlike_wireless/", "shortlink": "https://redd.it/12he7nb", "author": "t2_syh06v6d", "comment_count": 45, "comments": [{"comment_author": "t2_judy7", "body": "It’s absolutely insane to me that this is getting hype when Nomad released the exact same functioning charger 2 years ago. Same technology, same partnership with Aria and FreePower, just with a Tesla logo slapped on it. \n\nThis charger doesn’t even work that well. I’ve had it since Nomad released it for $220 and I wouldn’t even pay that for it, so I feel bad for the people paying $300+.", "created_utc": 1681124544.0, "edited": false, "id": "jfojvuz", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12he7nb/handson_with_teslas_300_airpowerlike_wireless/jfojvuz/", "score": 265, "ups": 265}, {"comment_author": "t2_11vi2v8x", "body": "I don’t care if this thing gave out blowjobs and could power my phone for a year on a single charge. I would rather charge my phone with a crank than give that fuckface at Tesla a single cent of my money.", "created_utc": 1681148625.0, "edited": false, "id": "jfq09f5", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12he7nb/handson_with_teslas_300_airpowerlike_wireless/jfq09f5/", "score": 5, "ups": 5}, {"comment_author": "t2_93075", "body": "They’re not the same. The nomad had 18. Tesla has 30", "created_utc": 1681135212.0, "edited": false, "id": "jfp30gw", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12he7nb/handson_with_teslas_300_airpowerlike_wireless/jfp30gw/", "score": 13, "ups": 13}, {"comment_author": "t2_bju52", "body": "Tesla fanboys will pay", "created_utc": 1681156382.0, "edited": false, "id": "jfqk06t", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12he7nb/handson_with_teslas_300_airpowerlike_wireless/jfqk06t/", "score": 1, "ups": 1}, {"comment_author": "t2_3t1fj", "body": "Yeah FreePower just sells off the shelf coils and controllers. Literally anyone could slap some Alcantara on top and sell them. Tesla does absolutely nothing here other than slap on a logo and profit.", "created_utc": 1681140310.0, "edited": false, "id": "jfpf3r6", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12he7nb/handson_with_teslas_300_airpowerlike_wireless/jfpf3r6/", "score": -5, "ups": -5}]}, {"id": "12gjwsk", "title": "Apple Continues Efforts to Keep Retail Stores From Unionizing", "flair": "Apple Retail", "subreddit": "r/apple", "created_utc": 1681047988.0, "upvote": 2138, "score": 2138, "upvote_ratio": 0.94, "self_text": "", "self_url": "https://www.bloomberg.com/news/newsletters/2023-04-09/apple-aapl-continues-efforts-to-keep-retail-stores-from-unionizing-lg9gjdx2", "permalink": "/r/apple/comments/12gjwsk/apple_continues_efforts_to_keep_retail_stores/", "shortlink": "https://redd.it/12gjwsk", "author": "t2_592euj7", "comment_count": 346, "comments": [{"comment_author": "t2_bb0hq", "body": "A couple thoughts as a former Apple Retail employee who found the working conditions better than when I worked for a similar job in a public sector union. \n\nApple Employees have the right to unionize but should seriously consider the pros and cons of representation.  Personally, I’d have voted against for the following, but not exclusive reasons:\n\nFirst, if the union and Apple can’t come to an agreement, there’s a good chance employees lose in arbitration.  Apple is likely going to argue that Apple Retail is no different than other retailer on the sale side, and that the Genius Bar isn’t really that different than the geek squad. \n\nApple retail pays over market and their benefits are over market compared to competitors like Best Buy or Micro Center.  And that’s without even mentioning the **absurdly good [Employee Stock Purchase Plan.](https://www.sec.gov/Archives/edgar/data/320193/000110465915019336/a15-5624_1ex10d1.htm)**\n\nA collective bargaining agreement negotiation and arbitration doesn’t start at where staff are today, it starts at zero. \n\nSecond there’s the issue of tenure.  Apple Retail isn’t a career for most, so staff tenure is a bathtub curb with peaks below 2 years and over 8 years.  Few employees exist in the 2-8 year tenure — most are either under 2 or 8+. \n\nSo a union would be great for those with tenure as they’ll see likely see priority in holiday bidding, shift swaps, and requests for time off.  They’ll also see advantages in promotions and wages. But if you’re a person looking for a short term position, you’ll be disadvantaged treatment vs those who have been there longer. \n\nWhen I was at ARS, I got promoted before colleagues with years more experience based on merit which kept me there longer.  Which is good for me as an employee and for Apple as an employer.  If I saw that those first rungs were based on seniority, I would have left sooner.  \n\nI also knew that Apple also tried to balance who got what days off and it wasn’t based on seniority. We had a system where you could request your priority for the four key days around Christmas and New Year’s and management ensured everyone got their top priority day off and usually their top one and two. It’d suck to work in retail where things like long weekends always went based on seniority.  For a solid chunk of the Apple Store employees (the less than 2 year crowd) they’d find themselves working every long weekend. \n\nThen there’s the flexibility of not working in a CBA.  If I had something in my personal life that I needed work to flex around, it didn’t need to go through a complicated union structure, my managers could just make it work.   If I asked to leave early, management didn’t have to offer it to other staff first and flexibility around things like bereavement was higher than it would be with a CBA. \n\nSure, Apple Store employees can unionize if they want but I see more harm than good for most employees, especially those who will suffer in a seniority based system.  I honestly there’s a lot of Apple Retail employees who haven’t actually fully evaluated the pros and cons of representation.", "created_utc": 1681183847.0, "edited": false, "id": "jfsa63r", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12gjwsk/apple_continues_efforts_to_keep_retail_stores/jfsa63r/", "score": 1, "ups": 1}, {"comment_author": "t2_ad96t", "body": "Steve Jobs kept people that helped him start Apple and make it a success from getting money or recognition. I doubt that some near minimum wage level person at an Apple Store would even get a second thought from **[Steve.](https://www.businessinsider.com/steve-wozniak-gave-early-apple-employees-10-million-in-stock-2014-9)**", "created_utc": 1681069173.0, "edited": false, "id": "jflw510", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12gjwsk/apple_continues_efforts_to_keep_retail_stores/jflw510/", "score": 3, "ups": 3}, {"comment_author": "t2_bb0hq", "body": "Hire pay is going to be a challenge, Apple is already way over market to comparable jobs in most areas. \n\nThat’s without considering the value of benefits offered to both full **and** part time employees and the generous employee stock purchase plan. \n\nIf a CBA goes to arbitration it might be a surprise to those expecting a win from representation.", "created_utc": 1681184094.0, "edited": false, "id": "jfsamdp", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12gjwsk/apple_continues_efforts_to_keep_retail_stores/jfsamdp/", "score": 1, "ups": 1}, {"comment_author": "t2_sl867fra", "body": "This might be a good time to address some commonly held misconceptions about EU unions and labor protections. \n\n>\tor you can quit for any reason.\n\nThis is still possible in the EU, the layoff protections only go one way. \nTechnically a termed contract (e.g. 12 months) has both parties on the hook for the full term but employees have the option to cancel it with a one month notice.   \nEven so, they can choose not to honor that one month and essentially get fired for refusal to work, which only affects their ability to collect unemployment. \n\nIn the US a two week notice is common, even with “at will” and if employees don’t give a two week notice it might affect their future employment by virtue of a negative reference. \nThis is a relatively rare occurrence in the EU even when not honoring the one month notice. \n\nAs for protections against being laid off and underperforming colleagues, there’s a performance review process that leads to improvement plans which then can lead to being let go. \nMeaning that it’s not impossible to let people go, you just have to cover your ass (CYA) and properly document, this is to ensure that it is indeed underperforming employees that get laid off and not just arbitrary or to squeeze out more profits by downsizing. \n\nLastly, unions and collective bargaining agreements (CBAs) just work entirely differently. Because the roles of unions is often codified in law to the point that laws directly refer to the most current CBA and the government often playing a mediating role, unionization efforts benefit the general populous. \n\nInstead of unionizing a specific company or worse, a specific location of a company, CBAs apply to entire industries and benefit everyone working in those industries wether they’re due paying union members or people who never had any direct interaction with a union. \n\nThis makes it harder to union bust and breed resentment over dues or something similar. \n\nA lot of the above are of course generalizations and individual member states might have their own deviations or even entire established traditions.\n\nEdit: defined abbreviations", "created_utc": 1681082325.0, "edited": 1681119373.0, "id": "jfmq8vb", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12gjwsk/apple_continues_efforts_to_keep_retail_stores/jfmq8vb/", "score": 15, "ups": 15}, {"comment_author": "t2_e50p7mgp", "body": "Genius level pay in Texas was around $22/hr. Colorado was more around $28-$32/hr.\n\nAs others pointed out, that’s two tiers above the specialist level. \n\nIt’s more and more common to see external hires for Genius roles. That was almost unheard of a couple years back.", "created_utc": 1681055043.0, "edited": false, "id": "jfkya53", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12gjwsk/apple_continues_efforts_to_keep_retail_stores/jfkya53/", "score": 8, "ups": 8}, {"comment_author": "t2_bb0hq", "body": "tl;dr: Sure, Apple Store employees can unionize if they want but I see more harm than good for most employees, especially those who will suffer in a seniority based system.  I honestly there’s a lot of Apple Retail employees who haven’t actually fully evaluated the pros and cons of representation. \n\n\nResponding to your comment though, a couple comments on that.\n\n\nFirst, if the union Apple can’t come to an agreement, there’s a good chance employees lose in arbitration.  Apple retail pays over market and their benefits are over market compared to competitors like Best Buy or even Micro Center.  And that’s without even mentioning the **absurdly good [Employee Stock Purchase Plan.](https://www.sec.gov/Archives/edgar/data/320193/000110465915019336/a15-5624_1ex10d1.htm)**\n\nApple is likely going to argue that Apple Retail is no different than other retailer on the sale side, and that the Genius Bar isn’t really that different than the geek squad. \n\nA collective bargaining agreement negotiation doesn’t start at where staff are today, it starts at zero. \n\nSecond there’s the issue of tenure.  Apple Retail isn’t a career for most, so staff tenure looks like a bath tub curb with peaks below 2 years and over 8 years.  Few employees exist in the 2-8 year tenure — most are either under 2 or 8+. \n\nSo a union would be great for those with tenure as they’ll see priority in holiday bidding, shift swaps, and requests for time off.  They’ll also see advantages in promotions and wages. But if you’re a person looking for a short term position, you’ll be disadvantaged treatment vs those who have been there longer. \n\nWhen I was at ARS, I got promoted before colleagues with years more experience based on merit which kept me there longer.  Which is good for me as an employee and for Apple as an employer.  If I saw that those first rungs were based on seniority, I would have left sooner.  \n\nI also knew that Apple also tried to balance who got what days off and it wasn’t based on seniority. We had a system where you could request your priority for the four key days around Christmas and New Year’s and management ensured everyone got their top priority day off and usually their top one and two. It’d suck to work in retail where things like long weekends always went based on seniority.  For a solid chunk of the Apple Store employees (the less than 2 year crowd) they’d find themselves working every long weekend. \n\nThen there’s the flexibility of not working in a CBA.  If I had something in my personal life that I needed work to flex around, it didn’t need to go through a complicated union structure, my managers could just make it work.   If I asked to leave early, management didn’t have to offer it to other staff first and flexibility around things like bereavement was higher than it would be with a CBA. \n\nSure, Apple Store employees can unionize if they want but I see more harm than good for most employees, especially those who will suffer in a seniority based system.  I honestly there’s a lot of Apple Retail employees who haven’t actually fully evaluated the pros and cons of representation.", "created_utc": 1681183511.0, "edited": false, "id": "jfs9jvd", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12gjwsk/apple_continues_efforts_to_keep_retail_stores/jfs9jvd/", "score": 1, "ups": 1}, {"comment_author": "t2_thtze", "body": "Who are you to tell me how to feel? I just got 8 weeks paid off for having a baby followed by 4 weeks of part time hours with full time pay. I have over $50k of apple stock sitting in an account that will be a down payment on a home one day. I get almost 3 weeks vacation per year. \n\nYou can’t tell someone how to feel. If I’m happy with my conditions, that is MY decision, not yours. Thanks and have a nice day", "created_utc": 1681072804.0, "edited": false, "id": "jfm4msm", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12gjwsk/apple_continues_efforts_to_keep_retail_stores/jfm4msm/", "score": 8, "ups": 8}, {"comment_author": "t2_xhvlj", "body": "Corporate roles such as software engineers get $50k of apple stock per year on the low end. $100k+ annually is more typical. I’m glad that you’re happy with your conditions but apple could afford pay you so much more.", "created_utc": 1681080163.0, "edited": false, "id": "jfmlh1k", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12gjwsk/apple_continues_efforts_to_keep_retail_stores/jfmlh1k/", "score": -2, "ups": -2}]}, {"id": "12ggd12", "title": "ChatGPT Assistant + ChatGPT keyboard for iOS. Use your own ChatGPT API key.", "flair": "Promo Sunday", "subreddit": "r/apple", "created_utc": 1681038452.0, "upvote": 1412, "score": 1412, "upvote_ratio": 0.86, "self_text": "Last week we shared Omni AI, while the idea seemed unanimously liked, the main objection was the subscription model and price, so we canceled it and delivered the main requested feature.\n\n[You can get the app on the App Store.](https://apps.apple.com/app/omni-ai-keyboard-chat/id6446796339)\n\n**The use your own API lifetime purchase is $10.99. The price is discounted for** r/Apple **during Promo Sunday from 19.99.**\n\nFor those out of the loop the main features of the app are:\n\n* ChatGPT keyboard brings ChatGPT everywhere you need it across iOS. You can ask it to write replies, email openers, tweets, descriptions without having to open the parent app or ChatGPT website.\n* ChatGPT chat interface, where it works like the web version of ChatGPT. For context driven and where chat memory is required.\n\n&#x200B;\n\nWe will be building other features with communities feedback as well, so let me know if you want to see anything else prioritized.\n\nYou can add your own API by tapping the settings icon and going to advanced.\n\n&#x200B;", "self_url": "https://www.reddit.com/r/apple/comments/12ggd12/chatgpt_assistant_chatgpt_keyboard_for_ios_use/", "permalink": "/r/apple/comments/12ggd12/chatgpt_assistant_chatgpt_keyboard_for_ios_use/", "shortlink": "https://redd.it/12ggd12", "author": "t2_g0x3a45q", "comment_count": 481, "comments": [{"comment_author": "t2_g0x3a45q", "body": "So the keyboard works the same across the system, the default model currently is 3.5, with more customization options coming.\n\nAs far as accuracy goes it's pretty much the same as with the web version of ChatGPT.\n\nYour API is stored on your device and doesn't hit our server at all. We do not store any data or logs in our servers.  Once you add your own API there is communication with OpenAI and our servers only serve to deliver basic functionality to the app. \n\nWe also tried to build the whole experience around the stock iOS keyboard so that the user feel comfortable at all times, since you only access OMNI when you need to send a request.", "created_utc": 1681069260.0, "edited": false, "id": "jflwcf2", "is_root": false, "is_submitter": true, "permalink": "/r/apple/comments/12ggd12/chatgpt_assistant_chatgpt_keyboard_for_ios_use/jflwcf2/", "score": 1, "ups": 1}, {"comment_author": "t2_mmvcd", "body": "Sure, but these models are already sophisticated enough to be better, more eloquent, more cogent writers than some percentage of people, and that percentage will only go up. What reason do they have not to use AI to write heartfelt apologies or console a grieving friend? \"I'm not doing anything wrong,\" they think. \"This person deserves better prose than I can write, so I'm actually doing them a favor.\" Imagine using ChatGPT to automate Tinder. It'll set you up on dates with a people you've never actually talked to. \n\nMaybe we'll end up in a world where video conferencing becomes a lot more common, since that's a lot harder to fake (you can make videos with AI, but you can't exactly send them over FaceTime)", "created_utc": 1681082370.0, "edited": 1681113304.0, "id": "jfmqcg6", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12ggd12/chatgpt_assistant_chatgpt_keyboard_for_ios_use/jfmqcg6/", "score": 2, "ups": 2}, {"comment_author": "t2_4kz4315t", "body": "Thank you for sharing your thoughts about the keyboard functionality and accuracy of the OMNI app. It's great to hear that the keyboard works consistently across the system, and that there are plans to introduce more customization options in the future.  \nI also appreciate that the API is stored on the user's device and doesn't hit the server, and that no data or logs are stored on the servers. This helps to ensure the privacy and security of user information.  \nIt's good to know that the app has been designed to integrate seamlessly with the stock iOS keyboard, providing a comfortable user experience. Overall, it seems that OMNI is a well-designed app that prioritizes user privacy and convenience.", "created_utc": 1681069888.0, "edited": false, "id": "jflxt82", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12ggd12/chatgpt_assistant_chatgpt_keyboard_for_ios_use/jflxt82/", "score": 1, "ups": 1}, {"comment_author": "t2_f72e", "body": "you think it’s possible to do a chat session per app? basically only storing a chat token per app and submitting it with the request? that would be a ics feature\n\nin terms of features i would look at most common requests like “rewrite” or “answer to: “ and make those buttons on the empty keyboard screen to not have to type it. or even a paste to “answer”. so you copy a text, then press the button “answer” and it will prompt with “write an answer to: {copied text}” and return that to the cursor or into clipboard?\n\nmaybe even let the user predefine prompt tokens pre/post copied/selected text. app wise that should be pretty easy to do and would make the app a lot quicker to use ;)", "created_utc": 1681081040.0, "edited": false, "id": "jfmnefq", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12ggd12/chatgpt_assistant_chatgpt_keyboard_for_ios_use/jfmnefq/", "score": 1, "ups": 1}, {"comment_author": "t2_g0x3a45q", "body": "Depends on the model of ChatGPT but they're really cheap if it's for individual use. If you ask ChatGPT for example: Hi how are you?  That would be 5 tokens. 1000 tokens cost about $0.002.\n\nOpenAI's explanation :\n\n>A helpful rule of thumb is that one token generally corresponds to \\~4 characters of text for common English text. This translates to roughly ¾ of a word (so 100 tokens \\~= 75 words).\n\nIn reality it depends on how much you use it, but it's usually a few cents to a few dollars most for light use. And you only pay for what you use with your own API.", "created_utc": 1681045584.0, "edited": 1681057318.0, "id": "jfkdyug", "is_root": false, "is_submitter": true, "permalink": "/r/apple/comments/12ggd12/chatgpt_assistant_chatgpt_keyboard_for_ios_use/jfkdyug/", "score": 23, "ups": 23}]}, {"id": "12fputb", "title": "Leaked iPhone 15 Pro Max glass shows extremely thin bezels", "flair": "Rumor", "subreddit": "r/apple", "created_utc": 1680968997.0, "upvote": 2279, "score": 2279, "upvote_ratio": 0.93, "self_text": "", "self_url": "https://appleinsider.com/articles/23/04/08/leaked-iphone-15-pro-max-glass-shows-extremely-thin-bezels", "permalink": "/r/apple/comments/12fputb/leaked_iphone_15_pro_max_glass_shows_extremely/", "shortlink": "https://redd.it/12fputb", "author": "t2_si3ckcez", "comment_count": 402, "comments": [{"comment_author": "t2_2xb11nfg", "body": "I know you are speaking in hypothetical meaningless wishes but Tim Cook would be fired, Apple would lose market share, and the stock would crash.", "created_utc": 1680975899.0, "edited": false, "id": "jfgxo3s", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fputb/leaked_iphone_15_pro_max_glass_shows_extremely/jfgxo3s/", "score": 65, "ups": 65}, {"comment_author": "t2_1vj35ip", "body": "The second they do this everyone will be like, “Apple is finished, stock price will tank, it’s the end.”", "created_utc": 1680990346.0, "edited": false, "id": "jfhvm3p", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fputb/leaked_iphone_15_pro_max_glass_shows_extremely/jfhvm3p/", "score": 2, "ups": 2}, {"comment_author": "t2_16k0hl", "body": "It’s an easy mistake to make because it’s actually fairly common among the younger crowd. I always like to mention it in case the person is an ESL speaker, or uses enough grammar/punctuation to make it seem like they’d care. It’s always risky though! Some people take it as an insult!", "created_utc": 1681011152.0, "edited": false, "id": "jfj2due", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fputb/leaked_iphone_15_pro_max_glass_shows_extremely/jfj2due/", "score": 40, "ups": 40}, {"comment_author": "t2_kgg5cteo", "body": "Yeah but I don’t care if he gets fired or their stock and marketshare drop", "created_utc": 1680999285.0, "edited": false, "id": "jfiese9", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fputb/leaked_iphone_15_pro_max_glass_shows_extremely/jfiese9/", "score": -1, "ups": -1}, {"comment_author": "t2_16ggbk", "body": "What?!\n\nWhere in the UK are you? The incorrect use of ‘how’ in the example given, sounds like such an Americanism I’m staggered you think it’s common in the UK.", "created_utc": 1681028863.0, "edited": false, "id": "jfjs0s2", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fputb/leaked_iphone_15_pro_max_glass_shows_extremely/jfjs0s2/", "score": 5, "ups": 5}]}, {"id": "12fsvum", "title": "Rivian CEO attempts to justify why the company refuses to offer CarPlay", "flair": "CarPlay", "subreddit": "r/apple", "created_utc": 1680975602.0, "upvote": 1326, "score": 1326, "upvote_ratio": 0.95, "self_text": "", "self_url": "https://9to5mac.com/2023/04/07/rivian-carplay-support/", "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/", "shortlink": "https://redd.it/12fsvum", "author": "t2_6a5dfaol", "comment_count": 590, "comments": [{"comment_author": "t2_96xwf", "body": "Several comments saying “I hate Tesla doesn’t have a car play but I’m still buying it” is exactly the reason why all these manufacturers will ditch car play. Even though people claim it’s a must have feature, many are willing to let it go.", "created_utc": 1680980771.0, "edited": false, "id": "jfh9ybc", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfh9ybc/", "score": 88, "ups": 88}, {"comment_author": "t2_35v87", "body": "It's no different than Tesla. As a Tesla owner I get it. I may not like it. But I get it. It's not the end of the world.", "created_utc": 1681004894.0, "edited": false, "id": "jfiqab9", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfiqab9/", "score": 8, "ups": 8}, {"comment_author": "t2_sjqzt9c7", "body": "After having a Tesla for a year I’m never going back to another car without CarPlay. Knew it was a mistake…Can’t wait for my lease to be up.", "created_utc": 1680989594.0, "edited": false, "id": "jfhtxcl", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhtxcl/", "score": 18, "ups": 18}, {"comment_author": "t2_jvzhy", "body": "Auto manufacturers need to stick with manufacturing automobiles. Historically, auto manufacturers have been terrible at implementing their own \"in-car\" technology systems.\n\n&#x200B;\n\n* Honda failed\n* Acura failed\n* Toyota failed, horribly\n* Lexus failed, miserably\n* Mercedes Benz failed\n* Ford was dog shit\n* GM was dog shit mixed with cat piss\n* Subaru was okay, but was basic af\n\nAll of these systems were much better once they were integrated with Apple and Android.  \n\n\nDefinitely no longer considering Rivian as a potential next vehicle if the in-car experience will be subpar. Tesla has also been taken off the list as well.", "created_utc": 1680987527.0, "edited": false, "id": "jfhpaho", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhpaho/", "score": 18, "ups": 18}, {"comment_author": "t2_7tn1d", "body": "This only frustrates me when the automaker’s offering is a total dud— seems like rivian and Tesla both have good UI. But maybe I’m wrong.", "created_utc": 1680976971.0, "edited": false, "id": "jfh08gk", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfh08gk/", "score": 19, "ups": 19}, {"comment_author": "t2_e8nv4", "body": "Seems the tide is turning on CarPlay, auto makers aren't giving up their systems, they are monetizing them. All the more reason to develop an Apple Car and make it exclusive if that's the way they want to play it. With EVs like Tesla and maybe Rivian (jury is still out on them how well they'll do), traditional auto makers are further digging their own graves with this greed.", "created_utc": 1680977851.0, "edited": false, "id": "jfh2ima", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfh2ima/", "score": 14, "ups": 14}, {"comment_author": "t2_5snd8", "body": "While I love CarPlay in my ICE, don’t miss it at all in the Tesla. The all in one infotainment, navigation, charging, etc. is something that CarPlay would never have.", "created_utc": 1680998598.0, "edited": false, "id": "jfidcnr", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfidcnr/", "score": 3, "ups": 3}, {"comment_author": "t2_7he61jp9", "body": "I hate this sentiment. Let me do whatever I want with my hardware. \n\nI’m planning to buy a Tesla sometime next year and the lack of CarPlay is really putting me off. Way to ruin a (subjectively) cool and good product with shit software", "created_utc": 1680976277.0, "edited": false, "id": "jfgyl46", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfgyl46/", "score": 12, "ups": 12}, {"comment_author": "t2_mygnsv0e", "body": "I drive a Tesla model 3 without CarPlay and the experience with things like music/messaging just sucks. My previous car had it and I don’t think I will buy another Tesla unless they add it.", "created_utc": 1681024118.0, "edited": false, "id": "jfjmbcp", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfjmbcp/", "score": 4, "ups": 4}, {"comment_author": "t2_nx3m3rmz", "body": "I own a Tesla. It lacks CarPlay. Its infotainment flat out sucks no matter what other Tesla fans think.\n\nI won't buy another car without CarPlay. I'm firm on that.", "created_utc": 1681012689.0, "edited": false, "id": "jfj56cd", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfj56cd/", "score": 3, "ups": 3}, {"comment_author": "t2_5sl20xyf", "body": "I hate CarPlay tbh. I had it on my rental when my Tesla was in the shop. I much prefer Tesla’s interface. CarPlay lags way too much and the user experience leaves a lot to be desired.", "created_utc": 1681044121.0, "edited": false, "id": "jfkbff8", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfkbff8/", "score": 1, "ups": 1}, {"comment_author": "t2_p9mp6", "body": "In the future we'll all be sorting through articles about how abysmally \"samey\" every car experience has become. All the people complaining about subscriptions - why do you think apple wants to own this space? They're either going to find a way to extract revenue from it via subscriptions, and if that doesn't work they're going to drop any serious development on it like a hot potato. Add to this that the gap between vehicle computing hardware and consumer hardware is shrinking quickly -- and there are some real opportunities for innovation in this space. Companies like Rivian and maybe Tesla most likely to deliver something unique. But everyone's basing their opinion on their 2015 RAV4 experience and going to kill off any opportunity we have for innovation in this space before it happens. Monopoly destroys innovation - simple as that.", "created_utc": 1681000113.0, "edited": false, "id": "jfigje4", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfigje4/", "score": 1, "ups": 1}, {"comment_author": "t2_8joh9", "body": "personally i don't like carplay.\n\nit is better than the shit-tier infotainment that auto manufacturers have produced, but Tesla and Rivian showed them how to do it right, and they are putting in the work.\n\nat the end of the day, built-in first-party will always have deeper integration to the rest of the car than third-party can. autonomous driving, for instance, will never work fully with carplay or android automotive, i think.", "created_utc": 1681012752.0, "edited": false, "id": "jfj5a6x", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfj5a6x/", "score": -3, "ups": -3}, {"comment_author": "t2_1lzatj35", "body": "I am using CarPlay for the last 2yrs on my new Sienna. The phone has to remain tethered with a cable to the system. Which means I have to remove the phone from my pocket, attach it and then change the system to CarPlay. Most of the time I don’t do it. Long drives maybe. \n\nOn the other hand if it was wireless, battery drainage may be an issue (i don’t know). Which means I still have to remove my phone from my pocket. This could still be better for short drives, I don’t need it. \n\nThe best thing that Tesla’s and Rivian’s systems, when they have all the features, don’t have this problem. \n\nThe Q I have is, what are you guys doing in CarPlay that you can’t do on Tesla?", "created_utc": 1680978713.0, "edited": false, "id": "jfh4qzi", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfh4qzi/", "score": -10, "ups": -10}, {"comment_author": "t2_f7jen", "body": "To everyone using a Tesla, how's the software experience?", "created_utc": 1681049083.0, "edited": false, "id": "jfkktmy", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfkktmy/", "score": -1, "ups": -1}, {"comment_author": "t2_sjqzt9c7", "body": "Tesla says the same thing and it’s obviously bullshit. Their engineers have made awful versions of Spotify and Apple Music and you have to pay Tesla $10 a month to use them.", "created_utc": 1680989682.0, "edited": false, "id": "jfhu4i3", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhu4i3/", "score": 32, "ups": 32}, {"comment_author": "t2_o1y4c", "body": "Devil's advocate opinion: given Rivian makes EV, EV-specific navigation is currently not very accurate/good on CarPlay & Android Auto (to an extent). As of 2023, neither of CarPlay or AA can use temperature, headwind & tailwind, elevation change, climate control usage, and vehicle speed to calculate a more accurate range estimate and remaining. \n\nSpecifically for range prediction context, Tesla collects data on it's whole fleet to further improve range estimates since it can interpolate existing past data. Exclusive to Tesla, the integration with the Supercharger network means the driver can know ahead of time about the charger availability and status. When nearing the charger, the vehicle can preemptively heat up the battery for fast charging. \n\nAll of those features I mentioned, would be unlikely to exist on current iterations of Car Play or Android Auto. Frankly speaking navigation and audio control are 98% reason why we use those systems in the first place. I don't discourage automakers actually improving the infotainment to be *competitive* with AA and CarPlay.", "created_utc": 1681112609.0, "edited": false, "id": "jfo5yz3", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfo5yz3/", "score": 1, "ups": 1}, {"comment_author": "t2_li3zgat", "body": "Sadly the EV market is in a rough state.\n\nTesla, no CarPlay or AA, same with Rivian. Competition is either behind Tesla, or doesn't have the standard of vehicle purchasing Tesla started (time travelling the industry from 2005 stealership shopping to just a transparent online purchase) \n\nIt's really a rough spot if you want an EV atm.", "created_utc": 1681035208.0, "edited": false, "id": "jfjz6zb", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfjz6zb/", "score": 13, "ups": 13}, {"comment_author": "t2_dt2g2", "body": "some moron who was texting and driving totaled my 2013 Civic a few weeks back. taking an apprenticeship next January so I’ll have no income for six months and can’t get into a loan right now. bought my dad’s 2008 Rav 4 off of him with my insurance settlement and went down to Best Buy and got myself a CarPlay stereo because the stock stereo didn’t even have Bluetooth audio like my Civic. it’s been awesome, don’t know how I lived without. no way could I go back to my phone’s screen for maps when I have a giant turn by turn screen with all of my music and phone calls/messages right there. it’s awesome.", "created_utc": 1681142304.0, "edited": false, "id": "jfpk2n9", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfpk2n9/", "score": 1, "ups": 1}, {"comment_author": "t2_aqhiy", "body": "I have a Tesla and prefer its built in OS to any CarPlay experience I’ve used", "created_utc": 1680985194.0, "edited": false, "id": "jfhjzue", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhjzue/", "score": 15, "ups": 15}, {"comment_author": "t2_u4d98", "body": "To bye honest I thought I’d hate that my Tesla didn’t have it but with an Apple Music app and online navigation I haven’t once regretted it.", "created_utc": 1680985656.0, "edited": false, "id": "jfhl1hl", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhl1hl/", "score": 2, "ups": 2}, {"comment_author": "t2_4idw1", "body": "For me too except Tesla.", "created_utc": 1681058928.0, "edited": false, "id": "jfl7px6", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfl7px6/", "score": 0, "ups": 0}, {"comment_author": "t2_f104f", "body": "One of the most underrated features in my Tesla. Vent direction is set by user profile so it is always perfect for me and for my wife as soon as we’re in the car with literally zero effort. Couldn’t be better.", "created_utc": 1681043446.0, "edited": false, "id": "jfkabpj", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfkabpj/", "score": 5, "ups": 5}, {"comment_author": "t2_4idw1", "body": "Tesla offers basic connectivity for free. The add’l $10/mo gets you live traffic and video streaming.", "created_utc": 1681059422.0, "edited": false, "id": "jfl8xmj", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfl8xmj/", "score": 0, "ups": 0}, {"comment_author": "t2_lglwbioq", "body": "Tesla folks are a different breed.  No gauge cluster and a terrifying lack of physical controls make me never want to go near one.", "created_utc": 1680986157.0, "edited": false, "id": "jfhm5xj", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhm5xj/", "score": 85, "ups": 85}, {"comment_author": "t2_21qp9twz", "body": "It has stopped me so far from buying a Tesla.  Although it's not the only reason, it's a strong factor.", "created_utc": 1680983743.0, "edited": false, "id": "jfhgqab", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhgqab/", "score": 31, "ups": 31}, {"comment_author": "t2_li3zgat", "body": "With EVs the game is different if you want an EV.\n\nNot many companies make them at the level of Tesla, so options are limited. Tesla also walked away from the 2005 stealership process and set the bar for vehicle purchases. \n\nI am in a tough decision deciding on if to get a Tesla or not, but I am struggling to find alternatives. My car is pretty much dead, and I want an EV at a Model 3 price that doesn't suck. Difficult to find, and when I find one (Hyundai actually has one) it's so limited availability and an impossible to navigate 2005 stealership hunt and peck process to purchase. Normally the stealership mess isn't a huge issue in ICE vehicles where there's abundance and variety. My ICE car is fucked so when I am back in the US mid summer I gotta get something. It may be a Tesla. It's really sad because otherwise I generally like the Tesla, save for a few decisions like Tesla vision.", "created_utc": 1681035646.0, "edited": false, "id": "jfjzoy7", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfjzoy7/", "score": 3, "ups": 3}, {"comment_author": "t2_62q2g", "body": "I’m probably in the minority but I prefer Tesla’s system over CarPlay", "created_utc": 1680984961.0, "edited": false, "id": "jfhjhb5", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhjhb5/", "score": 24, "ups": 24}, {"comment_author": "t2_5cfb7", "body": "I’m not sure how sustainable it is though. People will comprise everything to own a Tesla but the enthusiasm is dying.", "created_utc": 1680990191.0, "edited": false, "id": "jfhv9f4", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhv9f4/", "score": 2, "ups": 2}, {"comment_author": "t2_11q6wd", "body": "I think with Tesla, it’s just that Tesla is… different. I haven’t driven a Tesla but I am going to assume that it could also very well be that their proprietary stuff for navigation and such maybe just doesn’t suck so it’s less of a make or break concept for their drivers.\n\nIf you were driving a Tesla, I think that’s more of a lifestyle choice. Including the apps. I don’t think anybody is looking at GMC or Rivian and saying I’m going to buy that car because of the tech.", "created_utc": 1680987433.0, "edited": false, "id": "jfhp2tj", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhp2tj/", "score": 5, "ups": 5}, {"comment_author": "t2_jo1xagwl", "body": "Tesla's infotainment system is actually good though.\n\nCan't say the same for most traditional OEMs.", "created_utc": 1681013837.0, "edited": false, "id": "jfj74id", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfj74id/", "score": 2, "ups": 2}, {"comment_author": "t2_46lrl", "body": "Once the charging networks for non-Tesla cars are much better… I’ll be dumping my Tesla.", "created_utc": 1681017067.0, "edited": false, "id": "jfjck84", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfjck84/", "score": 1, "ups": 1}, {"comment_author": "t2_4idw1", "body": "Opposite for me. Been driving Tesla for 5yr. Just added an aftermarket CarPlay which works well but I never use it because the built-in nav is better and they just added Apple Music native.", "created_utc": 1681059570.0, "edited": false, "id": "jfl9acs", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfl9acs/", "score": 2, "ups": 2}, {"comment_author": "t2_77qka", "body": "Even good UI (which I have not used a Tesla or Rivian so I can't comment on their UI) can't get around an app not being offered by the car's native OS. For example, Tesla **just** got Apple Music very recently. After years of it existing and people asking for it. Until that happened, you were stuck with it just being able to be played as a Bluetooth connection from the phone - no native interface like they had with Spotify and other apps for a long time.\n\nSo like...Apple Music is fixed now, but for me, it shouldn't be something you have to worry about. If they simply offered CarPlay, there would never be an app \"missing\".\n\nOnce again, I have never sat in a Tesla, so maybe someone who has can shed more light on if this was an annoying problem until recently (not having an Apple Music app). I still don't believe there's a way to use Apple Maps with a Tesla, also correct me if I'm wrong there. And yes, there is always the answer of \"just use Spotify and google/other maps\", but those are not what I prefer.\n\nPersonally, for my next vehicle, I will not purchase a car unless it offers CarPlay.", "created_utc": 1680982233.0, "edited": false, "id": "jfhdcep", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhdcep/", "score": 12, "ups": 12}, {"comment_author": "t2_6a5dfaol", "body": "Tesla’s UI is… OK at best. It’s not as horrible as traditional automakers, but doesn’t hold a candle to CarPlay.", "created_utc": 1680977048.0, "edited": false, "id": "jfh0ezw", "is_root": false, "is_submitter": true, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfh0ezw/", "score": 24, "ups": 24}, {"comment_author": "t2_obbqo4w4", "body": "Tesla’s UI is decent. I wish I had some physical HVAC controls. I get where EV makers want drivers to use the in car maps since knowledge of the vehicle’s charge level when navigating is good. That said, Tesla apparently also spent money hiring a former high end brand audio engineer for the speakers in their vehicles, it would be nice if CarPlay was supported to have a way to get an audio source that takes advantage of their work. Bluetooth streaming doesn’t cut it. Paying for Tidal only helps when you’ve downloaded the HiFi version, not everyone has access to DRM free high bitrate tips for a USB drive.", "created_utc": 1680982208.0, "edited": false, "id": "jfhdac4", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhdac4/", "score": -2, "ups": -2}, {"comment_author": "t2_3t6j3", "body": "Why do these companies treat the stock infotainment and CarPlay as mutually exclusive?\n\nCarPlay is a must for me but I'm not going to connect my phone every time I drive.", "created_utc": 1680977438.0, "edited": false, "id": "jfh1f2c", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfh1f2c/", "score": 9, "ups": 9}, {"comment_author": "t2_ff0rysj6", "body": "The recent story about tesla employees watching \"intimate\" videos of tesla owners and making memes about the videos/poking fun at the drivers hasn't put you off?", "created_utc": 1680977015.0, "edited": false, "id": "jfh0c93", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfh0c93/", "score": 8, "ups": 8}, {"comment_author": "t2_7ldhz8zu", "body": "Stock has been tanking big time", "created_utc": 1681005365.0, "edited": false, "id": "jfir7r3", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfir7r3/", "score": 2, "ups": 2}, {"comment_author": "t2_6a5dfaol", "body": ">\tThe Q I have is, what are you guys doing in CarPlay that you can’t do on Tesla?\n\nBetter UX, access to more apps, Siri (as bad as it is, it is still better than Tesla’s voice commands), better maps, using my phone’s data connection instead of paying for a separate one for the car, better quality music etc etc etc.", "created_utc": 1680978872.0, "edited": false, "id": "jfh55qg", "is_root": false, "is_submitter": true, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfh55qg/", "score": 14, "ups": 14}, {"comment_author": "t2_77qka", "body": "Until very recently Tesla did not have an Apple Music app. They also did not have a Spotify app for a while. As far as I'm aware, there's still no way to use Apple Maps in a Tesla either.", "created_utc": 1680983192.0, "edited": false, "id": "jfhfi2k", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhfi2k/", "score": 2, "ups": 2}, {"comment_author": "t2_6a5dfaol", "body": "It is usable, but not great. My biggest gripes are:\n\n* They keep changing the interface subtly with every update. While not a problem on phones, it’s a pain in the car since you need to re-build your muscle memory every time.\n* The UI is not winning any awards for responsiveness.\n* It integrates with only a few music/audio providers — mainly Spotify, Apple Music and TuneIn if I recall correctly. You are out of luck if you use Amazon Music, YouTube Music, Audible, Libby, Google Play Books — or any other Audio app.\n* Your maps options are limited to what Tesla provides. I suppose that is expected since the Autopilot system uses those maps, but you miss out on the nicer interface of Apple Maps, or the rich data from Waze.\n* Tesla’s voice assistant sucks. Who thought it would be a good idea for a voice assistant to show its responses as text? Am I supposed to read the response while I am driving? While Siri is not great, it usually works well enough if you know its limitations. I ended up installing Echo Auto in my car. Imagine installing a device meant for really old cars with ancient infotainment systems on a Tesla! \n* You can’t download music. It really sucks while driving through areas with no AT&T coverage. Imagine driving through Yellowstone National Park!!\n* The music quality on supported apps is terrible - 64 Kbps or less. It stings even more considering how good Tesla’s sound system is. There is a clear difference when you play from your phone via Bluetooth vs directly on Tesla console.\n* The implementation of apps like Spotify and Apple Music is terrible. Apple Music in particular keeps logging out. I acknowledge that may be Apple’s fault though.\n* You don’t benefit from interface improvements made by Spotify, Apple Music etc.\n* If you are driving a borrowed or rental car, you need to log into everything.\n* You can’t get text notifications from WhatsApp or other apps - or respond to them by voice.\n* You can’t call using anything other than the native phone dialer.\n* You have to pay for the so called enhanced connectivity.\n\nI can go on, but they key point is that interface design and service integration does not appear to be a priority for Tesla. So why not leave it to those who specialize in that arena?\n\nTesla could provide CarPlay (and Android Auto) in a windowed mode — or work with Apple to integrate directly into their console — especially with the enhanced CarPlay coming up soon. That would be a win-win for all.", "created_utc": 1681057781.0, "edited": 1681058972.0, "id": "jfl4xn7", "is_root": false, "is_submitter": true, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfl4xn7/", "score": 4, "ups": 4}, {"comment_author": "t2_1c6acsmn", "body": "[GM is trying to switch to that “only native infotainment software” route on >2024 EVs](https://www.theverge.com/2023/4/4/23669523/gm-apple-carplay-android-auto-ev-restrict-access), but the key difference is that their previous models *already did* offer CarPlay. Unlike Rivian/Tesla, GM’s not just “refusing to add it”, they’re activity taking away a feature that consumers have come to expect in a [blatant push for more subscription revenue.](https://www.reuters.com/technology/gm-plans-phase-out-apple-carplay-evs-with-googles-help-2023-03-31/)\n\nIt’s a really, really bad move imo, unless they reverse course it will definitely prevent me from purchasing a GM for the foreseeable future.", "created_utc": 1681014425.0, "edited": false, "id": "jfj85ch", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfj85ch/", "score": 24, "ups": 24}, {"comment_author": "t2_ghlc747b", "body": ">\tgiven Rivian makes EV, EV-specific navigation is currently not very accurate/good on CarPlay & Android Auto (to an extent)\n\nyk who can fix that? rivian ;-)\n\nif they can make a good car app for navigation, they can stick it on a phone \n\n>\tAs of 2023, neither of CarPlay or AA can use temperature, headwind & tailwind, elevation change, climate control usage, and vehicle speed to calculate a more accurate range estimate and remaining.\n\nsoon carplay will, but even now cars like the f150 lightning and mustang mach e allow for carplay *alongside* their first party controls\n\nhttps://i.imgur.com/izOHdSU.jpg\n\n>\tSpecifically for range prediction context, Tesla collects data on it’s whole fleet to further improve range estimates since it can interpolate existing past data. Exclusive to Tesla, the integration with the Supercharger network means the driver can know ahead of time about the charger availability and status. When nearing the charger, the vehicle can preemptively heat up the battery for fast charging.\n\n>\tAll of those features I mentioned, would be unlikely to exist on current iterations of Car Play or Android Auto. Frankly speaking navigation and audio control are 98% reason why we use those systems in the first place. I don’t discourage automakers actually improving the infotainment to be competitive with AA and CarPlay.\n\nsee f150/mustang", "created_utc": 1681131393.0, "edited": false, "id": "jfov3q3", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfov3q3/", "score": 1, "ups": 1}, {"comment_author": "t2_2mwesas", "body": "The new Jaguar OS is beautiful for this too. Works very well with CarPlay and actually wants you to use it for music, you can set it to automatically open CarPlay when specific iPhones are present in the car and then play music / use their maps from there. \n\n\nThis is funny to me because that car OS is one of the nicest looking and functional I’ve seen in any car, on par with Tesla’s and they are still happy for you to use anything you want to replace it.", "created_utc": 1680982619.0, "edited": false, "id": "jfhe7kt", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhe7kt/", "score": 66, "ups": 66}, {"comment_author": "t2_6kqod", "body": "But that’s just it - I want CarPlay because I don’t want to have to worry that the services I use or change to are going to care about my car manufacturers OS. \n\nFor instance Apple Music wasn’t on Tesla for the longest time for whatever number of reasons. And that meant you were SOL for that while everyone else with CarPlay didn’t give it a second thought. \n\nWalled ecosystems are great when they’re well developed for but infuriating when you experience the limitations.", "created_utc": 1680989071.0, "edited": false, "id": "jfhsr9u", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhsr9u/", "score": 53, "ups": 53}, {"comment_author": "t2_5weea", "body": "I’ve rented a few teslas and yes their UI is good,  but I still found myself wanting for CarPlay. Looking at restaurant reviews on my phone? Well now I need to manually enter the destination on the car when I choose one. I found that annoying. \n\nI also have several audio apps on my phone I use frequently for which there is no equivalent on Tesla like Mixcloud or Overcast, which brings me back to interacting with those apps on my phone.", "created_utc": 1681046610.0, "edited": false, "id": "jfkfvi8", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfkfvi8/", "score": 5, "ups": 5}, {"comment_author": "t2_7sfcwp5k", "body": "Tesla is the only OS in any car I’ve driven that just work, I think it would be good for them to offer car play and android auto if people want to use it, but TeslaOS is great!", "created_utc": 1681036996.0, "edited": false, "id": "jfk1a0y", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfk1a0y/", "score": 4, "ups": 4}, {"comment_author": "t2_at5ev", "body": "Same. \nI don’t need CarPlay on Tesla\n\nHave a big beautiful google maps display\nSpotify and Apple Music apps\n\nWhat else is missing from CarPlay?", "created_utc": 1680991543.0, "edited": false, "id": "jfhy9co", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhy9co/", "score": 6, "ups": 6}, {"comment_author": "t2_edps3", "body": "Tesla’s UI is certainly the best of any automakers (with Rivian close behind) but it’s still not as good as CarPlay.\n\nAnd Tesla is breaking the GPL licence so not cool.", "created_utc": 1681054344.0, "edited": false, "id": "jfkwmz1", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfkwmz1/", "score": 2, "ups": 2}, {"comment_author": "t2_lab2bb7", "body": "For real. CarPlay would be a horrible experience on a larger, fully integrated screen like the one found in the Tesla M3. I see nothing wrong with vehicles not having CarPlay if they can offer absolutely solid alternatives with continuous regular updates and improvements. In fact, I prefer Tesla’s appearance and functionality. \n\nI’m also okay with a reasonably priced subscription if it comes with a data connection and frequent updates/improvements. In fact, I believe that’s a reasonable expectation.", "created_utc": 1681025249.0, "edited": false, "id": "jfjnp12", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfjnp12/", "score": 1, "ups": 1}, {"comment_author": "t2_46lrl", "body": "100% disagree. Have a Tesla and the worst part of the car is trashy UI.", "created_utc": 1681016931.0, "edited": false, "id": "jfjccgq", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfjccgq/", "score": 2, "ups": 2}, {"comment_author": "t2_5cfb7", "body": "Really? I’ve been in a number of Tesla Ubers and the whole interface looks horrendous.", "created_utc": 1680990106.0, "edited": false, "id": "jfhv2q3", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhv2q3/", "score": 4, "ups": 4}, {"comment_author": "t2_31z84", "body": "It’s slow as shit though. I’ve had CarPlay and now have a Tesla. I’d rather have CarPlay.", "created_utc": 1680991405.0, "edited": false, "id": "jfhxyn2", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhxyn2/", "score": -6, "ups": -6}, {"comment_author": "t2_4idw1", "body": "The best thing about Tesla UI is the trip planner and nav to chargers, something CarPlay does not currently offer.", "created_utc": 1681059187.0, "edited": false, "id": "jfl8d4t", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfl8d4t/", "score": 0, "ups": 0}, {"comment_author": "t2_sjqzt9c7", "body": "Aftermarket CarPlay?\n\nThe Tesla nav is definitely worse than Apple, Google and waze maps. I can’t even use a podcast app in Tesla.  Their interface is god awful and I’m counting down the days until I’m done with it", "created_utc": 1681061557.0, "edited": false, "id": "jfle4so", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfle4so/", "score": 4, "ups": 4}, {"comment_author": "t2_4idw1", "body": "Tesla UI is better because it’s built for a full res 15” screen unlike CarPlay which is low res cartoon made for 6” screens.", "created_utc": 1681059787.0, "edited": false, "id": "jfl9t8n", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfl9t8n/", "score": 4, "ups": 4}, {"comment_author": "t2_5z1z1w5v", "body": "Tesla’s UI drives me nuts", "created_utc": 1680980676.0, "edited": false, "id": "jfh9ps8", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfh9ps8/", "score": 1, "ups": 1}, {"comment_author": "t2_4idw1", "body": "CarPlay doesn’t have Tesla’s trip planner for charging stops. It’s must-have for road trips.", "created_utc": 1681060404.0, "edited": false, "id": "jflbani", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jflbani/", "score": 5, "ups": 5}, {"comment_author": "t2_5snd8", "body": "Yes and no. CarPlay gives you access to specific apps in a larger screen format but beyond that it’s still limited. \n\nI’m referring to the integration of all the different components into one. For example, CarPlay can’t control a vehicle HVAC or adjust audio settings. You would have to exit out to do so. \n\nOn my Tesla, the navigation takes all the concern of charging out, for example. You get real time data on charger availability along your route. If you set your destination before you start it will even tell you where and when to stop and charge. I can use voice commands for a ton of controls and never take my eyes off the road. \n\nWe have a family member who has an Audi E-Tron EV with CarPlay and Android Auto. It works really well but isn’t integrated into the gauge cluster. So you have to use the center display if you’re navigating because it doesn’t project on the digital cluster. \n\nI get why certain vehicles would do much better with an OEM setup vs CarPlay or Android Auto.", "created_utc": 1681047356.0, "edited": false, "id": "jfkhain", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfkhain/", "score": 1, "ups": 1}, {"comment_author": "t2_6lcg5", "body": "I’m really hoping the people that are deriding Rivian or Tesla or GM on here are doing the same of Apple. All of it sucks and is bad for consumers.", "created_utc": 1680979284.0, "edited": false, "id": "jfh65sh", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfh65sh/", "score": 3, "ups": 3}, {"comment_author": "t2_aqhiy", "body": "Why do you want CarPlay in your Tesla?", "created_utc": 1680985323.0, "edited": false, "id": "jfhkaas", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhkaas/", "score": -2, "ups": -2}, {"comment_author": "t2_z0lgx", "body": "Honestly trying to have all the car's controls and infotainment screens inside an app running through CarPlay seems like a degrade in service. Tesla recently added Apple Music to it's list of music apps and using it is seamless and doesn't interrupt all the other car's controls. Seems better for Apple to just work with the OEMs and release specific apps for the cars or rework CarPlay so that OEMs can block stuff like maps running through it.", "created_utc": 1681055082.0, "edited": false, "id": "jfkydhm", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfkydhm/", "score": -1, "ups": -1}, {"comment_author": "t2_ckw4fx2", "body": "No I didn’t. In fact, I acknowledged fully that apple is in the driver seat. But also cautioned them that sitting back and using customers demand as a bargaining chip is not sustainable. Tesla has done without them just fine. Entirely, some automakers including Volvo are using google’s android auto as the underlying tech in their cars. Apple could also reach out and do vertical integration directly. In fact when I saw Tim Cook test driving a Rivian I felt it was for the same reason. \n\nThe largest automaker America, GM, is planning on scrapping CarPlay. Ford could follow once they realize they can cash in on in-car ads. As we know, money matters more than anything to these businesses.", "created_utc": 1681006632.0, "edited": false, "id": "jfitpgi", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfitpgi/", "score": 0, "ups": 0}, {"comment_author": "t2_7tk8apoc", "body": "Tesla’s software is good. Perhaps 90% as good as CarPlay", "created_utc": 1681155304.0, "edited": false, "id": "jfqh9ib", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfqh9ib/", "score": 1, "ups": 1}, {"comment_author": "t2_li3zgat", "body": "It's really rough in the EV world.\n\nTesla doesn't offer it. Other EVs are either behind, also don't offer it or use the dealership process. Sadly Tesla set the bar for purchasing and availability and I don't know if I can go get an EV by shopping and calling around scammerships like it's 2005. \n\nWith combustion vehicles in the current marketplace you have options and it's practically forced to get one with Android Auto/Apple CarPlay. At least EVs have passable infotainment systems and nav, but the stock GPS and infotainment in most ICE vehicles are unusable dogshit.", "created_utc": 1681034816.0, "edited": false, "id": "jfjyqoa", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfjyqoa/", "score": 7, "ups": 7}, {"comment_author": "t2_3sulq", "body": "Same here. Except I think I’d still buy a Tesla.  You pretty much have to use their navigation on long trips to get routed to their supercharger stops.", "created_utc": 1681002588.0, "edited": false, "id": "jfilnxw", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfilnxw/", "score": 7, "ups": 7}, {"comment_author": "t2_3yitqk7a", "body": "Maybe because you're used to bad interfaces? I had CarPlay in my Leaf but do not miss it in my Tesla. And only use apple devices from earpods to watch, phone and laptop.", "created_utc": 1680983318.0, "edited": false, "id": "jfhfrrm", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhfrrm/", "score": -9, "ups": -9}, {"comment_author": "t2_6uhd3", "body": "Rivian and Tesla both have pretty good user OS, which makes the apple CarPlay exclusion less painful.", "created_utc": 1681070100.0, "edited": false, "id": "jflyb19", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jflyb19/", "score": 1, "ups": 1}, {"comment_author": "t2_p7zj7tu1", "body": "Using Tesla as an example,\n\n1. Bluetooth audio is fine, the car has built-in voice commands, and phone calls don't have a noticeable delay. Not sure why having to plug your phone in every time you enter your car is better.\n\n2. Personally not sure why you'd have an issue with allowing contact permissions.\n\n3. The maps do get updated without a subscription. No process, over cellular. \n\n4. Can see all of these things. If anything can see much more.\n\n5. I don't really want to be doing phone things while driving, besides maybe phone calls.", "created_utc": 1681024781.0, "edited": false, "id": "jfjn4ih", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfjn4ih/", "score": 1, "ups": 1}, {"comment_author": "t2_z0lgx", "body": "1: In a Rivian it just lowers the music volume slightly when it's giving directions, But it also shows the map directions in the gauge cluster so you don't even have to look at the main scree. \n\n2: I havn't seen calls come through my Rivian yet so I can't comment on this.   \n3: No need to pay money for Rivian's maps or navigation features, they regularly release updates that include different charging networks, they just included Tesla's CCS magic dock superchargers in the latest map update. Both Rivian and Tesla's maps will route you to chargers along a long distance drive. It's a better experience than trying to use a third party app that doesn't know about chargers (ABRP is the only one that comes close).   \n4: Rivian and Tesla's navigation overlay the music either to the side or the bottom of the navigation map. [https://www.rivianownersforum.com/attachments/rivian-infotainment-screen-navigation-dark-mode-jpg.1564/](https://www.rivianownersforum.com/attachments/rivian-infotainment-screen-navigation-dark-mode-jpg.1564/)  \n5: You can do most things via the cars infotainment system, in a Rivian or Tesla you also control AC, suspension, and other things through the main display.", "created_utc": 1681054861.0, "edited": false, "id": "jfkxuqi", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfkxuqi/", "score": 1, "ups": 1}, {"comment_author": "t2_aqhiy", "body": "If you press the share icon there’s an option to share a location directly to the Tesla and it’ll begin navigating to it", "created_utc": 1681046832.0, "edited": false, "id": "jfkgand", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfkgand/", "score": 1, "ups": 1}, {"comment_author": "t2_apfc4uny", "body": "Apple Music is terrible on Tesla. You can’t be serious.", "created_utc": 1681027986.0, "edited": false, "id": "jfjqzhx", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfjqzhx/", "score": 8, "ups": 8}, {"comment_author": "t2_67w7g", "body": "Spoken like someone who hasn’t been anywhere near a Tesla in years.", "created_utc": 1680990742.0, "edited": false, "id": "jfhwhy0", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhwhy0/", "score": 9, "ups": 9}, {"comment_author": "t2_dbgoh966", "body": "[Or the spyware.](https://www.theguardian.com/technology/2023/apr/07/tesla-intimate-car-camera-images-shared)", "created_utc": 1681021590.0, "edited": false, "id": "jfjj195", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfjj195/", "score": 3, "ups": 3}, {"comment_author": "t2_11q6wd", "body": "Yeah. As I mentioned, I’m not personally familiar with Tesla. But it doesn’t surprise me that they have offerings on par or beyond smartphone integrations. It remains to be seen if Rivian and GM will be able to say the same.", "created_utc": 1681059771.0, "edited": false, "id": "jfl9rtl", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfl9rtl/", "score": 0, "ups": 0}, {"comment_author": "t2_obbqo4w4", "body": "Fan speed, getting too hot or too cold while in the vehicle, wanting to change where the air is blowing (in a Tesla even the vent direction requires using the screen, I want A/C on my face but not heat), wanting to change air routing to Feet/Face/Windshield. I rarely change the temperature in the summer, I just vary the fan speed. In the winter, fogging windows and changing air temperature mean I adjust fan speed and temperature..\n\nI can do these things with a screen, doesn't mean I wouldn't like to have physical controls. There's a reason so many reviewers consider them to be a positive.", "created_utc": 1680992552.0, "edited": false, "id": "jfi0fp8", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfi0fp8/", "score": 0, "ups": 0}, {"comment_author": "t2_ghlc747b", "body": "exactly, tesla used to have my favorite interface but they’ve changed it a ton and added a cellular subscription so i’m back to carplay as #1", "created_utc": 1680992811.0, "edited": false, "id": "jfi1007", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfi1007/", "score": 82, "ups": 82}, {"comment_author": "t2_c1h42", "body": "You can use ABetterRoutePlanner, which I think lives up to its name. (If you’re in the car it’ll even read the state of charge via Bluetooth. The only thing using the Tesla maps gets you is prewarming the battery in the last few minutes before you arrive at the supercharger.\n\nHaving used CarPlay extensively before buying a model 3, I miss it intensely. The Tesla UI sucks in many many ways.", "created_utc": 1681019748.0, "edited": false, "id": "jfjgk92", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfjgk92/", "score": 0, "ups": 0}, {"comment_author": "t2_ghlc747b", "body": ">\tYou pretty much have to use their navigation on long trips to get routed to their supercharger stops\n\nnot if you don’t own a tesla 🤔", "created_utc": 1681003498.0, "edited": false, "id": "jfinh59", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfinh59/", "score": -7, "ups": -7}, {"comment_author": "t2_55xwygun", "body": "Overall Tesla’s infotainment is decent.  I still run Apple Maps on my phone in the city, and cross check Tesla Nav because it’s like Waze and will route you up and down residential streets to save 25 seconds, or have you do suicide lefts on major streets from said residential streets.\n\nAnd they update the software regularly. \n\nI do miss CarPlay.  But Tesla is at least “ok enough”.  I still do Audible or podcasts on my phone over Bluetooth, so my spot is saved without hassle.", "created_utc": 1681076579.0, "edited": false, "id": "jfmdezh", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfmdezh/", "score": 1, "ups": 1}, {"comment_author": "t2_4a9rt", "body": "Go to Apple Maps, type \"Tesla charger\" and hit return.", "created_utc": 1681090312.0, "edited": false, "id": "jfn78ul", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfn78ul/", "score": 1, "ups": 1}, {"comment_author": "t2_ghlc747b", "body": "my parents have a tesla and we would all prefer carplay, tesla’s ui changes too drastically with updates and a lot of their entertainment features are behind a subscription now \n\ni was going to get one someday but now i probably won’t because of no carplay", "created_utc": 1680984463.0, "edited": false, "id": "jfhicon", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhicon/", "score": 23, "ups": 23}, {"comment_author": "t2_4amtt", "body": "I thought I liked CarPlay until I used a Tesla for a few weeks and then tried CarPlay again. It’s honestly not that great. Better than most, sure, but Tesla blows it out of the water for EV’s.", "created_utc": 1680985595.0, "edited": false, "id": "jfhkwnm", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhkwnm/", "score": 9, "ups": 9}, {"comment_author": "t2_2fbwq22t", "body": "Yeah in my Tesla their system works fine. Idk, I only use it for maps, and for bluetooth I can already connect anyway.", "created_utc": 1680983370.0, "edited": false, "id": "jfhfvul", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhfvul/", "score": 4, "ups": 4}, {"comment_author": "t2_mdu39", "body": "I miss it in my Tesla.", "created_utc": 1680984790.0, "edited": false, "id": "jfhj34z", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhj34z/", "score": 2, "ups": 2}, {"comment_author": "t2_330mx", "body": "Just don’t buy a Tesla. Best solution.", "created_utc": 1681015384.0, "edited": false, "id": "jfj9rcu", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfj9rcu/", "score": 13, "ups": 13}, {"comment_author": "t2_9qkyrd29", "body": ">\tNot sure why having to plug your phone in every time you enter your car is better.\n\nHow often are you getting in and out of your car that taking 5 seconds to connect/disconnect matters?\n\n>\tPersonally not sure why you’d have an issue with allowing contact permissions.\n\nFor Tesla in particular, after all the shady stuff Musk and Tesla have done over the years (that we know about), you’re happy to just hand them the contact information for everyone you know? But in general, why would I hand my friends’ information over to who knows what third party analytics/data mining firms that the car company parters with?\n\n>\tThe maps do get updated without a subscription. No process, over cellular.\n\nThis is definitely not true for every car.\n\n>\tCan see all of these things. If anything can see much more.\n\nThe question was about why someone wouldn’t just play audio over Bluetooth instead of using CarPlay, not why they wouldn’t use a car’s built-in apps instead. Playing audio from your phone over Bluetooth doesn’t get you album art or podcast chapter art. Even if we were talking about the car’s built-in system, it’s not like the after-market unit in my 2008 Japanese import Toyota can stream music or podcasts anyway… The original unit that came with the car when it was new couldn’t even receive local FM radio…\n\n>\tI don’t really want to be doing phone things while driving, besides maybe phone calls.\n\nI’m talking about things like choosing a different podcast or playlist while you’re waiting at a light. It’s often illegal to do that on a phone, which means you legally have to pull over to do this if you’re using Bluetooth audio.", "created_utc": 1681037677.0, "edited": 1681038143.0, "id": "jfk23uh", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfk23uh/", "score": 1, "ups": 1}, {"comment_author": "t2_5weea", "body": "I’m guessing that’s if you have the tesla app installed, which I didn’t because it was a rental. Ok that’s good to know at least because it was getting on my nerves.", "created_utc": 1681052523.0, "edited": false, "id": "jfkse24", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfkse24/", "score": 3, "ups": 3}, {"comment_author": "t2_48sdw", "body": "I took delivery of a new Model Y last year and one of the doors was hung so wrong that it scraped its own paint off at the hinge when you opened/closed it. The door literally groaned and popped as it opened. It had numerous obvious paint issues that had to be repaired (drip, overspray, chips, waves). It had black flocking loose all over the inside of the console area (under the wireless phone mount, which is useless for phones under a certain size; Tesla service told me to \"put a McDonalds straw along the bottom\" as a fix). It absolutely blew my mind anyone would let this thing off the line, onto the truck, and then the delivery center not inspect it. All of those QA points failed. The delivery center also removed the new charge cable in the car at some point and threw in a scuffed-up used one and tried to deny it when I called them out on it. It took MONTHS to get these things all straightened out.\n\nI wanted to believe the people saying it was fixed but they're just wrong. I don't understand the people who make it their life's work to pump up this brand. It was for a brief time the best electric option but I don't think it's going to last.", "created_utc": 1681011087.0, "edited": 1681011484.0, "id": "jfj29kh", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfj29kh/", "score": 9, "ups": 9}, {"comment_author": "t2_bmspr", "body": "https://www.teslarati.com/tesla-placed-bottom-consumer-reports-reliability-rankings/", "created_utc": 1681054062.0, "edited": false, "id": "jfkvz3g", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfkvz3g/", "score": 2, "ups": 2}, {"comment_author": "t2_8vnc8", "body": "Doubtful. They’re extremely common Uber cars.", "created_utc": 1681057779.0, "edited": false, "id": "jfl4xhh", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfl4xhh/", "score": 1, "ups": 1}, {"comment_author": "t2_31z84", "body": "I keep mine at 72 and the Tesla auto heats and cools. The only button I’d might like is the defog button but that is super fast to push anyway.", "created_utc": 1680993357.0, "edited": false, "id": "jfi27rd", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfi27rd/", "score": 4, "ups": 4}, {"comment_author": "t2_5sl20xyf", "body": "Tesla’s interface is 1000x better than CarPlay. It’s much clearer, smoother, and easier to use.", "created_utc": 1681044219.0, "edited": false, "id": "jfkbl86", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfkbl86/", "score": -5, "ups": -5}, {"comment_author": "t2_3sulq", "body": "Well, the auto routing in the car goes “oh you want to go from here to there?  That’s 300 miles and I can only go 200 miles so you will need to stop at this supercharger station along the way and charge up to 80% while you’re there.  Don’t worry I’ll pre-heat the battery for you so you get the fastest charging speeds possible”. \n\nApple Maps just routes you to whatever charger is nearby, which since they aren’t as common as gas stations means you may end up stranded. Plus it won’t pre-heat the battery for you so you’ll be there longer charging.", "created_utc": 1681097310.0, "edited": false, "id": "jfnky00", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfnky00/", "score": 1, "ups": 1}, {"comment_author": "t2_949v3", "body": "Actually, the only thing that requires a subscription is anything involving a cellular data connection.\n\nWith the exception of Sentry Mode and Google Live Traffic data\\*, there's nothing stopping you from just using your phone as a hotspot and letting the car stream from that connection.\n\nEven the basic navigation doesn't require a monthly subscription (because of safety and low battery charging concerns).\n\n\\* For the live traffic, just use your phone's Google Maps and [share it to the Tesla app.](https://support.google.com/maps/answer/144361?hl=en&co=GENIE.Platform%3DiOS&oco=0)", "created_utc": 1680986100.0, "edited": false, "id": "jfhm16i", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhm16i/", "score": 5, "ups": 5}, {"comment_author": "t2_i6w6b0u", "body": "I had the opposite experience, tbh. I always figured CarPlay was a nice to have but unnecessary feature and having a “good” infotainment system like a Tesla would make it useless. But then I rented a Tesla for a week and concluded I’d never even consider buying a car without CarPlay support.", "created_utc": 1681002197.0, "edited": false, "id": "jfikvdc", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfikvdc/", "score": 3, "ups": 3}, {"comment_author": "t2_p7zj7tu1", "body": "Choosing a specific song, yes. I'd have to pay for the monthly plan to use the Spotify app. But actually album artwork does somehow show up over Bluetooth.\n\nPersonally I see benefits having these features separate from my phone. My car can get me home even if my phone is snapped in half. Also I have friends and family members with carplay, and it's not incredibly rare that something doesn't work and we spend 5 min trying to fix carplay before leaving. Design-wise I think it's a bit silly for a cars infotainment to rely on someone's separate smartphone being connected, and I can see why car manufacturers wouldn't want to be held responsible when something goes wrong. \n\nHowever I do agree that Tesla/Rivian should just swallow their pride and include carplay/android auto. If it's buggy or slow, people will use the built-in stuff anyway. Personally I'd probably skip using it.", "created_utc": 1681057702.0, "edited": false, "id": "jfl4qx1", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfl4qx1/", "score": 0, "ups": 0}, {"comment_author": "t2_aqhiy", "body": "One thing that Siri does well is play the songs you tell it to play.  I'm always looking for the easiest way to do stuff, and asking Siri to play a song while driving is definitely a lot easier than manually searching through an app.\n\nBut the Tesla streaming service on its own is really good, so sometimes I just push the steering wheel button and say 'play song' and it pays it.  Couldn't be easier.", "created_utc": 1680991266.0, "edited": false, "id": "jfhxnoj", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhxnoj/", "score": 6, "ups": 6}, {"comment_author": "t2_4agvk", "body": ">\tIn the electric vehicle market specifically, I don’t have that luxury. Not many companies make them\n\nSeems like almost every brand has at least 1 EV now.  Off the top of my head I know about Subaru, Ford, Tesla, Rivan, Chevrolet, Nissan, BMW, Hyundai, Kia.\n\nIt would probably be more accurate at this point to say there’s no EV manufacturer with an offering you liked.  Which incidentally is the same reason I’m still using an iPhone despite becomining increasingly frustrated with iOS and Apple in general.", "created_utc": 1681070362.0, "edited": false, "id": "jflywp8", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jflywp8/", "score": 1, "ups": 1}, {"comment_author": "t2_67w7g", "body": "Reliability ≠ Build quality. I could also post [multiple](https://electrek.co/2022/09/07/tesla-model-y-top-safety-rating-australia-ancap/) links [about](https://thedriven.io/2022/11/18/newest-tesla-model-s-gets-highest-ever-safety-score-from-euro-ncap/) how [Tesla](https://www.accessoriesfortesla.com/post/how-tesla-makes-the-safest-cars-in-the-world) is [among](https://cleantechnica.com/2022/10/01/the-tesla-model-y-earned-europes-highest-safety-score-in-history/) the safest car brands on the road. So what? Those are both different evaluations.", "created_utc": 1681055210.0, "edited": false, "id": "jfkyo8m", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfkyo8m/", "score": 0, "ups": 0}, {"comment_author": "t2_obbqo4w4", "body": "My temperature has rarely gone over 65, occasionally when it’s been under 0F, I’ve raised it a bit. \n\nThe third party buttons help a bit for fan speed changes, I still do it all the time though. I wish Tesla would at least accept they’re a thing and enable them to also sync with the screen displayed fan speed.", "created_utc": 1680993599.0, "edited": false, "id": "jfi2qk6", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfi2qk6/", "score": 0, "ups": 0}, {"comment_author": "t2_4a9rt", "body": "Apple Maps will route you to whichever charger you like.\n\nAnd the inability to pre-heat the battery unless you use Tesla's navigation sounds like a Tesla problem, not an Apple problem.", "created_utc": 1681170832.0, "edited": false, "id": "jfri7ha", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfri7ha/", "score": 1, "ups": 1}, {"comment_author": "t2_mdu39", "body": "App control more than the limited Bluetooth capabilities for my audiobook and podcast apps (e.g. changing playback speed) without having to use my phone while I drive.\n\nApple Music integration that works quickly and doesn’t require me to sign in all the time. \n\nSupporting in an integrated way many apps that Tesla doesn’t yet", "created_utc": 1680986249.0, "edited": 1680986438.0, "id": "jfhmddz", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhmddz/", "score": 3, "ups": 3}, {"comment_author": "t2_li3zgat", "body": "Yeah but you can only reliably get Teslas. There may be a wait but it tells you how long, and you always pay the OEM MSRP.\n\nIf it's a dealership wall and not generally available I don't count it. Half the time there's no unfriend online option to find the EV you want, or you are paying above MSRP all the time. That's part of why Tesla is winning, usurping that shit legacy model.\n\nI am looking, however at the Hyundai Inioq 6. Some Tesla decisions (subscription GPS, no Android auto/CarPlay, removing radar sensors) are just poor. Such a shame too, Tesla EVs are good EVs otherwise. It won't matter if I can't get one at MSRP though. \n\nBut yeah it's pretty much the Apple strategy they're going for. Which is too bad, I don't think many people legitimacy like the commercialized and profit oriented aspect of the Apple methods to form a walled ecosystem to an extreme. They just buy them in spite because it's a decent product.\n\nThis will only work for Tesla if competition doesn't catch up. Which it has already, they just haven't scaled up production capacity or ditched the scammerships in favor of the more modern ways people now espect. In the EV world people aren't going back to sleazy salesmen and thousands above MSRP. Even if that means being on a waitlist as long as the wait is communicated and consistent people will accept it. Once they catch up lights out Tesla.", "created_utc": 1681075716.0, "edited": 1681076454.0, "id": "jfmbdv3", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfmbdv3/", "score": 1, "ups": 1}, {"comment_author": "t2_aqhiy", "body": "Not only does Tesla as a company take that sort of thing seriously, but congress has put some pretty big teeth behind data management and privacy laws lately", "created_utc": 1681006108.0, "edited": false, "id": "jfisog5", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfisog5/", "score": 2, "ups": 2}, {"comment_author": "t2_2pteu9z4", "body": "Those just sound like you need a premium subscription to use cellular. I stopped paying for the premium over the winter since I don’t go on any trips over the winter but I still have sentry mode (I think you need a premium subscription to stream video to your phone), and all of the other things when I use a hotspot. I think it’s a bit disingenuous to say they are behind a paywall, they just require a connection that Tesla has to buy off of some cellular provider.", "created_utc": 1680985972.0, "edited": false, "id": "jfhlqnv", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhlqnv/", "score": 1, "ups": 1}, {"comment_author": "t2_aqhiy", "body": "that's the best part of driving a Tesla.  you're much less tired after driving when you let autopilot keep the car in the lane.", "created_utc": 1680991619.0, "edited": false, "id": "jfhyfb9", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfhyfb9/", "score": 4, "ups": 4}, {"comment_author": "t2_9qkyrd29", "body": ">\tNot only does Tesla as a company take that sort of thing seriously\n\n“They share intimate videos of customers around the office without their consent, but only if the customer opts in.” Are you hearing yourself right now?", "created_utc": 1681006289.0, "edited": false, "id": "jfit1ej", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfit1ej/", "score": -2, "ups": -2}, {"comment_author": "t2_5cfb7", "body": "It’s crazy that you post your own experience and the Tesla fanboys come out to say you’re wrong and that’s not what happened. You’re not allowed to believe reality.", "created_utc": 1681072884.0, "edited": false, "id": "jfm4tkv", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfm4tkv/", "score": 1, "ups": 1}, {"comment_author": "t2_aqhiy", "body": "I'm on my second Tesla, been driving since 2018, I've had maybe 10 phantom braking incidents total (just slowdowns, never a slamming on the brakes incident, you just put your foot on the accelerator to let it know it can keep going), but haven't experienced one in more than a year so I'm not sure how common that is anymore, but in any case it was never bad enough to make me not like driving the car or use the system.", "created_utc": 1680992596.0, "edited": false, "id": "jfi0jdi", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfi0jdi/", "score": 4, "ups": 4}, {"comment_author": "t2_ghlc747b", "body": "yeah tesla is definitely still better than many, but at the end of the day i’d still rather have carplay because there’s no separate cellular bill, all your media apps on iphone are just automatically there and signed in (even in someone else’s car), and all your maps destinations carry over\n\nof course with the tesla you get video streaming/sentry mode/lots of other extras but i still won’t buy a car without carplay", "created_utc": 1680995989.0, "edited": false, "id": "jfi7wge", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfi7wge/", "score": 3, "ups": 3}, {"comment_author": "t2_5weea", "body": "Idk. The other Model 3 I rented the year before was more or less the same. Most of the time it worked perfectly fine but constantly being on guard about what kind of dumb shit it’s going to pull was the opposite of relaxing. On an hour long drive I could count on having at least a couple of phantom events. \n\nI’ve had similar issues in a Nissan (slamming on the brakes for no fucking reason) so I’m not really trying to single Tesla out. I think camera based technology is just flawed for this kind of thing.", "created_utc": 1681052390.0, "edited": false, "id": "jfks2yi", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fsvum/rivian_ceo_attempts_to_justify_why_the_company/jfks2yi/", "score": 1, "ups": 1}]}, {"id": "12fud83", "title": "Reminder: using Chrome on a Mac defeats Apple's privacy features", "flair": "Safari", "subreddit": "r/apple", "created_utc": 1680978724.0, "upvote": 814, "score": 814, "upvote_ratio": 0.86, "self_text": "", "self_url": "https://appleinsider.com/articles/23/04/08/reminder-using-chrome-on-a-mac-defeats-apples-privacy-features", "permalink": "/r/apple/comments/12fud83/reminder_using_chrome_on_a_mac_defeats_apples/", "shortlink": "https://redd.it/12fud83", "author": "t2_6a5dfaol", "comment_count": 319, "comments": [{"comment_author": "t2_oakga9wt", "body": "Shit dude I’m hardwired with the machine in a faraday cage and routing through 2 seed boxes on opposite ends of the planet. \n\nOr.. nah I just use stock ass Safari. It works hella well didn’t even think to use Chrome (which needs a fucking DevRig to work on).", "created_utc": 1681000516.0, "edited": false, "id": "jfihduq", "is_root": true, "is_submitter": false, "permalink": "/r/apple/comments/12fud83/reminder_using_chrome_on_a_mac_defeats_apples/jfihduq/", "score": 2, "ups": 2}, {"comment_author": "t2_k86f1jkg", "body": "This works on macOS ... I''d done this when Ventura dropped--and then promptly forgot about it. It doesn't work on iOS or iPadOS--the later is where I do my browsing.\n\n&#x200B;\n\nI've used browsers since Netscape Navigator. There's muscle memory there--Tabs start at the left and new tabs are added to the right at a consistent size, not magically expanded to fit the available tab bar space. If I believed in conspiracies, I'd say Apple was training a new audience in how tabs work in the hopes that they would find traditional browser behavior 'abnormal'.\n\n&#x200B;\n\nSafari is blazingly fast--if it works for you that's great. It doesn't work for me. I keep it around for use on Apple's sites, as well as the occasional site that Firefox w/ plugins breaks. I won't use Chrome or Bing. Tried Opera years ago and found it even weirder than Safari.\n\n&#x200B;\n\nI've been exclusively Apple since the 1990s. I own Apple stock. If you have a problem with my criticism of their products, that's on you.", "created_utc": 1681040786.0, "edited": false, "id": "jfk6981", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fud83/reminder_using_chrome_on_a_mac_defeats_apples/jfk6981/", "score": 0, "ups": 0}, {"comment_author": "t2_6hav2hnh", "body": "Owning Apple stock does not mean that your criticisms are valid. Millions of people use Apple products and own AAPL. You are no smarter than they are.", "created_utc": 1681054725.0, "edited": false, "id": "jfkxiye", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fud83/reminder_using_chrome_on_a_mac_defeats_apples/jfkxiye/", "score": 1, "ups": 1}, {"comment_author": "t2_13d7hg", "body": ">\tBitwarden I find the interface a bit outdated and watched someone who was going into more detail about the software stack and it also seemed a bit outdsted.\n\nI mean, it's bog-standard React Native on mobile and Electron on desktop. Pretty common.\n\nBackend written in .NET, but it doesn't really matter since it's a zero-knowledge storage system where the backend doesn't ever see your credentials or data. You can even host a third-party lightweight \"Vaultwarden\" server (written in Rust) and host your own password manager at home.", "created_utc": 1681026077.0, "edited": false, "id": "jfjop0v", "is_root": false, "is_submitter": false, "permalink": "/r/apple/comments/12fud83/reminder_using_chrome_on_a_mac_defeats_apples/jfjop0v/", "score": 6, "ups": 6}]}]